export default {
    actions: {

    },

    mutations: {

    },
    state: {
        // Массив с темами
        themesArr: [
            'Авто',
            'Бизнес',
            'Красота, косметика',
            'Жизнь заграницей',
            'Здоровье',
            'Медицина',
            'Изучение языков',
            'Книги',
            'Лайфстайл',
            'Мамочки',
            'Маркетинг, реклама, бренд',
            'Мотивация',
            'Наука',
            'Фотография',
            'Образование',
            'Отношения',
            'Похудение',
            'Правильное питание, ЗОЖ',
            'Психология',
            'Путешествия',
            'Саморазвитие',
            'Секс',
            'Семья',
            'Сад, огород, цветы',
            'СММ, продвижение блогов',
            'Спорт, фитнес',
            'Танцы',
            'Искусство',
            'Творчество',
            'Феминизм',
            'Лайфхаки',
            'Дом, интерьер, ремонт',
            'Животные',
            'Мода, стиль',
            'Музыка',
            'Природа, экология',
            'Продуктивность',
            'Профессии',
            'Рецепты, еда',
            'Рукоделие',
            'Фильмы, сериалы',
            'Эзотерика',
            'Юмор'],
        // Массив со странами
        countryArr: [
            'Австралийский Союз',
            'Австрийская Республика',
            'Азербайджанская Республика',
            'Республика Албания',
            'Алжирская Народная Демократическая Республика',
            'Республика Ангола',
            'Княжество Андорра',
            'Антигуа и Барбуда',
            'Аргентинская Республика',
            'Республика Армения',
            'Исламская Республика Афганистан',
            'Содружество Багамских Островов',
            'Народная Республика Бангладеш',
            'Барбадос',
            'Королевство Бахрейн',
            'Республика Беларусь',
            'Белиз',
            'Королевство Бельгия',
            'Республика Бенин',
            'Республика Болгария',
            'Многонациональное Государство Боливия',
            'Босния и Герцеговина',
            'Республика Ботсвана',
            'Федеративная Республика Бразилия',
            'Государство Бруней-Даруссалам',
            'Буркина-Фасо',
            'Республика Бурунди',
            'Королевство Бутан',
            'Республика Вануату',
            'Соединённое Королевство Великобритании и Северной Ирландии',
            'Венгрия',
            'Боливарианская Республика Венесуэла',
            'Демократическая Республика Восточный Тимор',
            'Социалистическая Республика Вьетнам',
            'Габонская Республика',
            'Республика Гаити',
            'Кооперативная Республика Гайана',
            'Республика Гамбия',
            'Республика Гана',
            'Республика Гватемала',
            'Гвинейская Республика',
            'Республика Гвинея-Бисау',
            'Федеративная Республика Германия',
            'Республика Гондурас',
            'Гренада',
            'Греческая Республика',
            'Грузия',
            'Королевство Дания',
            'Республика Джибути',
            'Содружество Доминики',
            'Доминиканская Республика',
            'Арабская Республика Египет',
            'Республика Замбия',
            'Республика Зимбабве',
            'Государство Израиль',
            'Республика Индия',
            'Республика Индонезия',
            'Иорданское Хашимитское Королевство',
            'Республика Ирак',
            'Исламская Республика Иран',
            'Ирландия',
            'Исландия',
            'Королевство Испания',
            'Итальянская Республика',
            'Йеменская Республика',
            'Республика Кабо-Верде',
            'Республика Казахстан',
            'Королевство Камбоджа',
            'Республика Камерун',
            'Канада',
            'Государство Катар',
            'Республика Кения',
            'Республика Кипр',
            'Киргизская Республика',
            'Республика Кирибати',
            'Китайская Народная Республика',
            'Республика Колумбия',
            'Союз Коморских Островов',
            'Республика Конго',
            'Демократическая Республика Конго',
            'Корейская Народно-Демократическая Республика',
            'Республика Корея',
            'Республика Коста-Рика',
            "Республика Кот-д'Ивуар",
            'Республика Куба',
            'Государство Кувейт',
            'Лаосская Народно-Демократическая Республика',
            'Латвийская Республика',
            'Королевство Лесото',
            'Республика Либерия',
            'Ливанская Республика',
            'Ливия',
            'Литовская Республика',
            'Княжество Лихтенштейн',
            'Великое Герцогство Люксембург',
            'Республика Маврикий',
            'Исламская Республика Мавритания',
            'Республика Мадагаскар',
            'Республика Малави',
            'Малайзия',
            'Республика Мали',
            'Мальдивская Республика',
            'Республика Мальта',
            'Королевство Марокко',
            'Республика Маршалловы Острова',
            'Мексиканские Соединённые Штаты',
            'Республика Мозамбик',
            'Республика Молдова',
            'Княжество Монако',
            'Монголия',
            'Республика Союз Мьянма',
            'Республика Намибия',
            'Республика Науру',
            'Федеративная Демократическая Республика Непал',
            'Республика Нигер',
            'Федеративная Республика Нигерия',
            'Королевство Нидерландов',
            'Республика Никарагуа',
            'Новая Зеландия',
            'Королевство Норвегия',
            'Объединённые Арабские Эмираты',
            'Султанат Оман',
            'Исламская Республика Пакистан',
            'Республика Палау',
            'Республика Панама',
            'Независимое Государство Папуа — Новая Гвинея',
            'Республика Парагвай',
            'Республика Перу',
            'Республика Польша',
            'Португальская Республика',
            'Республика Руанда',
            'Румыния',
            'Республика Эль-Сальвадор',
            'Независимое Государство Самоа',
            'Республика Сан-Марино',
            'Демократическая Республика Сан-Томе и Принсипи',
            'Королевство Саудовская Аравия',
            'Республика Северная Македония',
            'Республика Сейшельские Острова',
            'Республика Сенегал',
            'Сент-Винсент и Гренадины',
            'Федерация Сент-Китс и Невис',
            'Сент-Люсия',
            'Республика Сербия',
            'Республика Сингапур',
            'Сирийская Арабская Республика',
            'Словацкая Республика',
            'Республика Словения',
            'Соединённые Штаты Америки',
            'Соломоновы Острова',
            'Федеративная Республика Сомали',
            'Республика Судан',
            'Республика Суринам',
            'Республика Сьерра-Леоне',
            'Республика Таджикистан',
            'Королевство Таиланд',
            'Объединённая Республика Танзания',
            'Тоголезская Республика',
            'Королевство Тонга',
            'Республика Тринидад и Тобаго',
            'Тувалу',
            'Тунисская Республика',
            'Туркменистан',
            'Турецкая Республика',
            'Республика Уганда',
            'Республика Узбекистан',
            'Украина',
            'Восточная Республика Уругвай',
            'Федеративные Штаты Микронезии',
            'Республика Фиджи',
            'Республика Филиппины',
            'Финляндская Республика',
            'Французская Республика',
            'Республика Хорватия',
            'Центральноафриканская Республика',
            'Республика Чад',
            'Черногория',
            'Чешская Республика',
            'Республика Чили',
            'Швейцарская Конфедерация',
            'Королевство Швеция',
            'Демократическая Социалистическая Республика Шри-Ланка',
            'Республика Эквадор',
            'Республика Экваториальная Гвинея',
            'Государство Эритрея',
            'Королевство Эсватини',
            'Эстонская Республика',
            'Федеративная Демократическая Республика Эфиопия',
            'Южно-Африканская Республика',
            'Республика Южный Судан',
            'Ямайка',
            'Япония'
        ],
        // Массив с городами по странам
        cityObj: {
            'страна не выбрана': ['сначала выберите страну'],
            'Австралийский Союз': ['Сидней', 'Мельбурн'],
            'Российская Федерация': [],
        },
        // Массив с городами России
        RusCities: [

            'Москва',

            'Санкт-Петербург',

            'Новосибирск',

            'Екатеринбург',

            'Нижний Новгород',

            'Казань',

            'Челябинск',

            'Омск',

            'Самара',

            'Ростов-на-Дону',

            'Уфа',

            'Красноярск',

            'Воронеж',

            'Пермь',

            'Волгоград',

            'Краснодар',

            'Саратов',

            'Тюмень',

            'Тольятти',

            'Ижевск',

            'Барнаул',

            'Ульяновск',

            'Иркутск',

            'Хабаровск',

            'Ярославль',

            'Владивосток',

            'Махачкала',

            'Томск',

            'Оренбург',

            'Кемерово',

            'Новокузнецк',

            'Рязань',

            'Астрахань',

            'Набережные Челны',

            'Пенза',

            'Киров',

            'Липецк',

            'Чебоксары',

            'Балашиха',
            ,
            'Калининград'
            ,
            'Тула'
            ,
            'Курск'
            ,
            'Севастополь'
            ,
            'Сочи'
            ,
            'Ставрополь'
            ,
            'Улан-Удэ'
            ,
            'Тверь'
            ,
            'Магнитогорск'
            ,
            'Иваново'
            ,
            'Брянск'
            ,
            'Другой город'

        ],

        ageCat: [
            '13',
            '18',
            '25',
            '35',
            '45',
            '55',
            '64+'
        ],
        genderCat: [
            'Любой','Мужской','Женский'
        ],

    },

    getters: {
        allThemes(state) {
            state.themesArr.sort();
            state.themesArr.push('Другая тема');
            state.themesArr.unshift('Без темы');
            return state.themesArr
        },

        allCountries(state) {
            state.countryArr.unshift('Российская Федерация');
            return state.countryArr
        },
        allCities(state) {

            state.cityObj['Российская Федерация'] = state.RusCities

            return state.cityObj
        },
        allAgeCat(state) {

            return state.ageCat
        },
        allGenderCat(state) {

            return state.genderCat
        },
    },
}